# ДЗ-1

## Структура БД

![Структура](HW01.svg)

Не все таблицы доведены до 3НФ, т. к. было сказано, что для ДЗ можно 
полностью не доводить и около 5-ти таблиц будет достачно.


| Таблица | Текущая НФ | Примечание |
|---------|----|--|
| customer | 0НФ  | 0НФ, т. к. значение поля address, например "4 Delaware Trail" содержит, и номер дома, и улицу. Если разнести по таблицам address, postcode, state, country, то будет 3 НФ |
| job_industry_category | 3НФ | Из таблицы customer |
| wealth_segment | 3НФ | Из таблицы customer |
| transaction | 3НФ | Находилась в 1НФ, т. к. были атрибуты brand, product_*, которые относятся к продукту (product) и не зависят от transaction_id |
| product | 3НФ | Из таблицы transaction |
| brand | 3НФ | Из таблицы transaction |
| product_line | 3НФ | Из таблицы transaction |
| product_class | 3НФ | Из таблицы transaction |
| product_size | 3НФ | Из таблицы transaction |

Прочее:
- product: Поле transaction_product_id (в оригинале product_id) имеет странные значения.

In [2]:
import pandas as pd

In [121]:
# filename = "customer_and_transaction.xlsx"
filename = "/home/rin/study/storage-systems/project/hw01/customer_and_transaction.xlsx"
t = pd.read_excel(filename, sheet_name="transaction")
t.index += 1
c = pd.read_excel(filename, sheet_name="customer")
c.index += 1

In [122]:
t.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost
1,8708,0,5034,2017-10-07,False,Approved,Solex,Road,medium,medium,416.98,312.735016
2,16701,0,5034,2017-01-27,False,Approved,Norco Bicycles,Standard,medium,medium,360.40,270.299988
3,17469,0,5034,2017-01-03,False,Approved,OHM Cycles,Road,medium,medium,742.54,667.400024
4,4771,0,3495,2017-12-17,True,Approved,Trek Bicycles,Road,medium,medium,533.51,400.130000
5,18035,0,3495,2017-01-13,True,Approved,Norco Bicycles,Road,medium,medium,544.05,376.840000

In [8]:
t.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    20000 non-null  int64
 1   product_id        20000 non-null  int64
 2   customer_id       20000 non-null  int64
 3   transaction_date  20000 non-null  datetime64[ns]
 4   online_order      19640 non-null  object
 5   order_status      20000 non-null  object
 6   brand             19803 non-null  object
 7   product_line      19803 non-null  object
 8   product_class     19803 non-null  object
 9   product_size      19803 non-null  object
 10  list_price        20000 non-null  float64
 11  standard_cost     19803 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(3), object(6)
memory usage: 1.8+ MB

In [123]:
c.head()

,customer_id,first_name,last_name,gender,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
1,1,Laraine,Medendorp,F,1953-10-12 00:00:00,Executive Secretary,Health,Mass Customer,N,Yes,060 Morning Avenue,2016,New South Wales,Australia,10
2,2,Eli,Bockman,Male,1980-12-16 00:00:00,Administrative Officer,Financial Services,Mass Customer,N,Yes,6 Meadow Vale Court,2153,New South Wales,Australia,10
3,3,Arlin,Dearle,Male,1954-01-20 00:00:00,Recruiting Manager,Property,Mass Customer,N,Yes,0 Holy Cross Court,4211,QLD,Australia,9
4,4,Talbot,NaN,Male,1961-10-03 00:00:00,NaN,IT,Mass Customer,N,No,17979 Del Mar Point,2448,New South Wales,Australia,4
5,8,Rod,Inder,Male,1962-03-30 00:00:00,Media Manager I,NaN,Mass Customer,N,No,97736 7th Trail,2023,New South Wales,Australia,12

In [10]:
c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 15 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_id            4000 non-null   int64
 1   first_name             4000 non-null   object
 2   last_name              3875 non-null   object
 3   gender                 4000 non-null   object
 4   DOB                    3913 non-null   object
 5   job_title              3494 non-null   object
 6   job_industry_category  3344 non-null   object
 7   wealth_segment         4000 non-null   object
 8   deceased_indicator     4000 non-null   object
 9   owns_car               4000 non-null   object
 10  address                4000 non-null   object
 11  postcode               4000 non-null   int64
 12  state                  4000 non-null   object
 13  country                4000 non-null   object
 14  property_valuation     4000 non-null   int64
dtypes: int64(3), object(12)
memory usage: 468.9+ KB

In [178]:
# transaction
dfs = {}
columns = ['brand', 'product_line', 'product_class', 'product_size']
for col in columns:
    print(f"\nTRUNCATE {col} RESTART IDENTITY CASCADE;")
    df = t[col].dropna().unique()
    df = pd.DataFrame(df)
    df.index += 1
    df.columns = ['name']    
    for i in df.iterrows():
        print(f"INSERT INTO {col} (id, name) VALUES ({i[0]}, '{i[1]['name']}');")
    df = pd.DataFrame(df)
    df.index += 1
    df.columns = ['name']    

    dfs[col] = df

TRUNCATE brand RESTART IDENTITY CASCADE;
INSERT INTO brand (id, name) VALUES (1, 'Solex');
INSERT INTO brand (id, name) VALUES (2, 'Norco Bicycles');
INSERT INTO brand (id, name) VALUES (3, 'OHM Cycles');
INSERT INTO brand (id, name) VALUES (4, 'Trek Bicycles');
INSERT INTO brand (id, name) VALUES (5, 'Giant Bicycles');
INSERT INTO brand (id, name) VALUES (6, 'WeareA2B');

TRUNCATE product_line RESTART IDENTITY CASCADE;
INSERT INTO product_line (id, name) VALUES (1, 'Road');
INSERT INTO product_line (id, name) VALUES (2, 'Standard');
INSERT INTO product_line (id, name) VALUES (3, 'Touring');
INSERT INTO product_line (id, name) VALUES (4, 'Mountain');

TRUNCATE product_class RESTART IDENTITY CASCADE;
INSERT INTO product_class (id, name) VALUES (1, 'medium');
INSERT INTO product_class (id, name) VALUES (2, 'high');
INSERT INTO product_class (id, name) VALUES (3, 'low');

TRUNCATE product_size RESTART IDENTITY CASCADE;
INSERT INTO product_size (id, name) VALUES (1, 'medium');
INSERT INTO product_size (id, name) VALUES (2, 'large');
INSERT INTO product_size (id, name) VALUES (3, 'small');

In [181]:
dfs['job_industry_category']['name']

1                Health
2    Financial Services
3              Property
4                    IT
5         Manufacturing
6           Argiculture
7         Entertainment
8                Retail
9    Telecommunications
Name: name, dtype: object

In [180]:
# customer
columns = ['job_industry_category', 'wealth_segment']
for col in columns:
    print(f"\nTRUNCATE {col} RESTART IDENTITY CASCADE;")
    df = c[col].dropna().unique()
    df = pd.DataFrame(df)
    df.index += 1
    df.columns = ['name']    
    for i in df.iterrows():
        print(f"INSERT INTO {col} (id, name) VALUES ({i[0]}, '{i[1]['name']}');")

    dfs[col] = df

TRUNCATE job_industry_category RESTART IDENTITY CASCADE;
INSERT INTO job_industry_category (id, name) VALUES (1, 'Health');
INSERT INTO job_industry_category (id, name) VALUES (2, 'Financial Services');
INSERT INTO job_industry_category (id, name) VALUES (3, 'Property');
INSERT INTO job_industry_category (id, name) VALUES (4, 'IT');
INSERT INTO job_industry_category (id, name) VALUES (5, 'Manufacturing');
INSERT INTO job_industry_category (id, name) VALUES (6, 'Argiculture');
INSERT INTO job_industry_category (id, name) VALUES (7, 'Entertainment');
INSERT INTO job_industry_category (id, name) VALUES (8, 'Retail');
INSERT INTO job_industry_category (id, name) VALUES (9, 'Telecommunications');

TRUNCATE wealth_segment RESTART IDENTITY CASCADE;
INSERT INTO wealth_segment (id, name) VALUES (1, 'Mass Customer');
INSERT INTO wealth_segment (id, name) VALUES (2, 'High Net Worth');
INSERT INTO wealth_segment (id, name) VALUES (3, 'Affluent Customer');

In [55]:
for name, df in dfs.items():
    print(f"---- {name} ----")
    print(df)

---- brand ----
             name
1           Solex
2  Norco Bicycles
3      OHM Cycles
4   Trek Bicycles
5  Giant Bicycles
6        WeareA2B
---- product_line ----
       name
1      Road
2  Standard
3   Touring
4  Mountain
---- product_class ----
     name
1  medium
2    high
3     low
---- product_size ----
     name
1  medium
2   large
3   small
---- job_industry_category ----
                 name
1              Health
2  Financial Services
3            Property
4                  IT
5       Manufacturing
6         Argiculture
7       Entertainment
8              Retail
9  Telecommunications
---- wealth_segment ----
                name
1      Mass Customer
2     High Net Worth
3  Affluent Customer

In [82]:
for item in c.iterrows():
    print(item)
    break

(0, customer_id                                1
first_name                           Laraine
last_name                          Medendorp
gender                                     F
DOB                      1953-10-12 00:00:00
job_title                Executive Secretary
job_industry_category                 Health
wealth_segment                 Mass Customer
deceased_indicator                         N
owns_car                                 Yes
address                   060 Morning Avenue
postcode                                2016
state                        New South Wales
country                            Australia
property_valuation                        10
Name: 0, dtype: object)

In [83]:
c.head()

,customer_id,first_name,last_name,gender,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,1953-10-12 00:00:00,Executive Secretary,Health,Mass Customer,N,Yes,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,Eli,Bockman,Male,1980-12-16 00:00:00,Administrative Officer,Financial Services,Mass Customer,N,Yes,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,3,Arlin,Dearle,Male,1954-01-20 00:00:00,Recruiting Manager,Property,Mass Customer,N,Yes,0 Holy Cross Court,4211,QLD,Australia,9
3,4,Talbot,NaN,Male,1961-10-03 00:00:00,NaN,IT,Mass Customer,N,No,17979 Del Mar Point,2448,New South Wales,Australia,4
4,8,Rod,Inder,Male,1962-03-30 00:00:00,Media Manager I,NaN,Mass Customer,N,No,97736 7th Trail,2023,New South Wales,Australia,12

In [ ]:
right = dfs['job_industry_category']
df = c.merge(right=right, left_on='job_industry_category', right_on='name', right_index=True)
df = df.rename(columns={'right_index': 'job_industry_category_id'}).reset_index(drop=True)
# .reset_index(drop=True)
# df.rename(columns={'index': 'industry_id'})
df

In [149]:
from sqlalchemy import create_engine, Table, MetaData, Column, Integer, String
from sqlalchemy.orm import DeclarativeBase, declarative_base
from sqlalchemy.dialects.postgresql import (
    insert, 
    VARCHAR,
    TEXT,
    DATE,
    INTEGER,
    FLOAT,
    BOOLEAN,
)

BaseModel = declarative_base()

In [99]:
print(c.columns)

Index(['customer_id', 'first_name', 'last_name', 'gender', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'address', 'postcode', 'state', 'country',
       'property_valuation'],
      dtype='object')

In [ ]:
# Есть ли повторения customer_id
c[c['customer_id'].value_counts() > 1]['customer_id']

Series([], Name: customer_id, dtype: int64)

In [167]:
print(c['deceased_indicator'].unique())
print(c['owns_car'].unique())

['N' 'Y']
['Yes' 'No']

In [154]:
conn_str = 'postgresql://postgres:postgres@localhost:5432/local_hw01'
engine = create_engine(conn_str)
metadata = MetaData()

# class Customer(DeclarativeBase):
#     __table_name__ = 'customer',
#     __table_args__ = {'schema': 'public', 'extend_existing': True}

#     # 'customer', metadata,
#     id                          = Column(INTEGER, primary_key=True),
#     first_name                  = Column(VARCHAR(1024)),
#     last_name                   = Column(VARCHAR(1024)),
#     gender                      = Column(VARCHAR(1)),
#     dob                         = Column(DATE),
#     job_title                   = Column(TEXT),
#     job_industry_category_id    = Column(INTEGER),
#     wealth_segment_id           = Column(INTEGER),
#     deceased_indicator          = Column(BOOLEAN),
#     owns_car                    = Column(BOOLEAN),
#     address                     = Column(TEXT),
#     postcode                    = Column(VARCHAR(4)),
#     state                       = Column(TEXT),
#     country                     = Column(TEXT),
#     property_valuation          = Column(INTEGER),


table = Table(
    'customer', metadata,
    Column('id', INTEGER, primary_key=True),
    Column('first_name', VARCHAR(1024)),
    Column('last_name', VARCHAR(1024)),
    Column('gender', VARCHAR(1)),
    Column('dob', DATE),
    Column('job_title', TEXT),
    Column('job_industry_category_id', INTEGER),
    Column('wealth_segment_id', INTEGER),
    Column('deceased_indicator', BOOLEAN),
    Column('owns_car', BOOLEAN),
    Column('address', TEXT),
    Column('postcode', VARCHAR(4)),
    Column('state', TEXT),
    Column('country', TEXT),
    Column('property_valuation', INTEGER),
)

In [184]:

# Define the insert statement
# stmt = insert(my_table).values(id=1, name='John Doe', age=30)

def get_id(col: str) -> int:
    df = dfs[col]
    res_id = df[df['name'] == data[col]].index[0]
    print(f"get_id: {col}: {res_id}")

    res_id = int(res_id)
    return res_id

def parse_bool(data: str) -> bool:
    if data[0] == 'Y':
        result = True
    elif data[0] == 'N':
        result = False 
    else:
        raise ValueError(f"Value parsing error: {df[col]}")
    print(f"parse_bool: {result}, {data}")
    return result
    

i = 1
with engine.connect() as conn:
    for item in c.iterrows():
        data = item[1]
        id = data['customer_id']
        print(id, data['first_name'])
        # col = 'job_industry_category'
        # df = dfs[col]
        # job_industry_category_id = df[df['name'] == data['job_industry_category']].index[0]
        # print(f"job_industry_category: {job_industry_category_id}")
        stmt = insert(table).values(
            id=id,
            first_name=data['first_name'],
            last_name=data['last_name'],
            gender=data['gender'].lstrip().upper()[0],
            dob=data['DOB'],
            job_title=data['job_title'],
            job_industry_category_id=get_id('job_industry_category'),
            wealth_segment_id=get_id('wealth_segment'),
            deceased_indicator=parse_bool(data['deceased_indicator']),
            owns_car=parse_bool(data['owns_car']),
            address=data['address'],
            postcode=data['postcode'],
            state=data['state'],
            country=data['country'],
            property_valuation=int(data['property_valuation']),
        )
        conn.execute(stmt)
        conn.commit()
        # if i > 2:
        #     break
        i += 1

print(f"Total: {i}")

1 Laraine
get_id: job_industry_category: 1
get_id: wealth_segment: 1
parse_bool: False, N
parse_bool: True, Yes
2 Eli
get_id: job_industry_category: 2
get_id: wealth_segment: 1
parse_bool: False, N
parse_bool: True, Yes
3 Arlin
get_id: job_industry_category: 3
get_id: wealth_segment: 1
parse_bool: False, N
parse_bool: True, Yes
4 Talbot
get_id: job_industry_category: 4
get_id: wealth_segment: 1
parse_bool: False, N
parse_bool: False, No
8 Rod

IndexError: index 0 is out of bounds for axis 0 with size 0

ProgrammingError: (psycopg2.ProgrammingError) can't adapt type 'numpy.int64'
[SQL: 
INSERT INTO customer (
    id, first_name, last_name, gender, dob, job_title, job_industry_category_id, wealth_segment_id, deceased_indicator, owns_car, address, postcode, state, country, property_valuation) VALUES (%(id)s, %(first_name)s, %(last_name)s, %(gender)s, %(dob)s, %(job_title)s, %(job_industry_category_id)s, %(wealth_segment_id)s, %(deceased_indicator)s, %(owns_car)s, %(address)s, %(postcode)s, %(state)s, %(country)s, %(property_valuation)s
    )]
[parameters: 
{
    'id': 1, 'first_name': 'Laraine', 'last_name': 'Medendorp', 'gender': 'F', 
    'dob': datetime.datetime(1953, 10, 12, 0, 0), 
    'job_title': 'Executive Secretary', 
    'job_industry_category_id': np.int64(1), 
    'wealth_segment_id': np.int64(1), 
    'deceased_indicator': False, 
    'owns_car': True, 
    'address': '060 Morning Avenue', 'postcode': 2016, 'state': 'New South Wales', 'country': 'Australia', 'property_valuation': 10}]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [177]:
dfs

{'brand':              name
 2           Solex
 3  Norco Bicycles
 4      OHM Cycles
 5   Trek Bicycles
 6  Giant Bicycles
 7        WeareA2B,
 'product_line':        name
 2      Road
 3  Standard
 4   Touring
 5  Mountain,
 'product_class':      name
 2  medium
 3    high
 4     low,
 'product_size':      name
 2  medium
 3   large
 4   small}

In [ ]:
df